//  Задайте строку, содержащую латинские буквы в обоих регистрах. Сформируйте строку, в которой все заглавные буквы заменены на строчные.

string simpleString = "EEdfewWEvv3";
System.Console.WriteLine(simpleString.ToLower());